#######################################################
#                                                     
#  Innovus Command Logging File                     
#  Created on Wed Mar 12 20:13:39 2025                
#                                                     
#######################################################

#@(#)CDS: Innovus v15.23-s045_1 (64bit) 04/22/2016 12:32 (Linux 2.6.18-194.el5)
#@(#)CDS: NanoRoute 15.23-s045_1 NR160414-1105/15_23-UB (database version 2.30, 317.6.1) {superthreading v1.26}
#@(#)CDS: AAE 15.23-s014 (64bit) 04/22/2016 (Linux 2.6.18-194.el5)
#@(#)CDS: CTE 15.23-s022_1 () Apr 22 2016 09:38:45 ( )
#@(#)CDS: SYNTECH 15.23-s008_1 () Apr 12 2016 21:52:59 ( )
#@(#)CDS: CPE v15.23-s045
#@(#)CDS: IQRC/TQRC 15.1.4-s213 (64bit) Tue Feb  9 17:31:28 PST 2016 (Linux 2.6.18-194.el5)

set_global _enable_mmmc_by_default_flow      $CTE::mmmc_default
suppressMessage ENCEXT-2799
getDrawView
loadWorkspace -name Physical
win
set init_pwr_net VDD
set init_gnd_net VSS
set init_verilog ./netlist/core.v
set init_design_netlisttype Verilog
set init_design_settop 1
set init_top_cell core
set init_lef_file {/home/linux/ieng6/ee260bwi25/xiz225/PDKdata/lef/tcbn65gplus_8lmT2.lef ./subckt/sram_w16_in.lef}
set init_lef_file {/home/linux/ieng6/ee260bwi25/xiz225/PDKdata/lef/tcbn65gplus_8lmT2.lef ./subckt/sram_w16_out.lef}
create_library_set -name WC_LIB -timing "$worst_timing_lib ./subckt/sram_w16_in_WC.lib ./subckt/sram_w16_out_WC.lib"
create_library_set -name BC_LIB -timing "$best_timing_lib ./subckt/sram_w16_in_BC.lib ./subckt/sram_w16_out_BC.lib"
create_rc_corner -name Cmax -cap_table $worst_captbl -T 125
create_rc_corner -name Cmin -cap_table $best_captbl -T -40
create_delay_corner -name WC -library_set WC_LIB -rc_corner Cmax
create_delay_corner -name BC -library_set BC_LIB -rc_corner Cmin
create_constraint_mode -name CON -sdc_file [list $sdc]
create_analysis_view -name WC_VIEW -delay_corner WC -constraint_mode CON
create_analysis_view -name BC_VIEW -delay_corner BC -constraint_mode CON
init_design -setup WC_VIEW -hold BC_VIEW
set_interactive_constraint_modes {CON}
setDesignMode -process 65
floorPlan -site core -r 1 0.5 100 100 100 100
globalNetConnect VDD -type pgpin -pin VDD -inst * -verbose
globalNetConnect VSS -type pgpin -pin VSS -inst * -verbose
addRing -spacing {top 1 bottom 1 left 1 right 1} -width {top 2 bottom 2 left 2 right 2} -layer {top M1 bottom M1 left M2 right M2} -center 1 -type core_rings -nets {VSS  VDD}
setAddStripeMode -break_at block_ring
pan -132.735 -72.969
pan 29.288 -103.841
pan -56.413 75.218
pan -8.175 134.901
pan 21.500 -195.768
pan 21.161 -14.428
pan -51.941 130.814
pan 0.000 105.806
pan 12.505 -119.271
pan 29.817 75.026
pan 67.897 -49.258
pan 82.541 -3.994
pan 539.178 -42.602
setDrawView ameba
setDrawView place
gui_select -rect {-383.007 148.111 -227.245 180.062}
setDrawView fplan
pan 20.200 -93.300
pan 171.694 172.511
pan -108.100 -86.243
pan -9.034 -30.578
pan 82.576 31.069
pan -46.602 -3.271
pan 9.729 42.392
pan -62.136 -108.740
pan 70.294 134.682
pan -40.395 -9.559
pan 106.384 -16.651
pan -95.047 -13.423
pan -155.950 -43.714
pan -129.263 -41.003
pan 106.770 -95.228
pan -212.748 32.818
pan 8.838 4.071
pan -21.755 0.786
pan -89.377 -10.545
pan -67.412 -7.645
pan -114.467 -7.695
pan -69.258 -160.638
gui_select -rect {-196.185 398.829 4.119 392.039}
selectObject Module mac_array_instance
deselectAll
pan 205.962 -20.370
selectObject Module mac_array_instance
pan -147.115 74.689
deselectAll
selectObject Module mac_array_instance
deselectAll
selectObject Module mac_array_instance
deselectAll
selectObject Module ofifo_inst
gui_select -rect {-640.925 107.993 -760.880 148.733}
selectObject Module mac_array_instance
deselectAll
selectObject Module mac_array_instance
deselectAll
selectObject Module psum_mem_instance
deselectAll
selectObject Module kmem_instance
deselectAll
selectObject Module kmem_instance
deselectAll
selectObject Module qmem_instance
deselectAll
selectObject Module kmem_instance
gui_select -rect {-401.014 71.780 -330.851 124.968}
selectObject Module qmem_instance
deselectAll
pan 71.294 -18.107
zoomBox -172.419 406.750 -38.883 407.882
gui_select -rect {-235.387 471.775 -98.230 479.964}
pan -3.772 2.514
